far-mat42/custom-escooter/BMS PCB/Testing/STM32 Testing Ground/Nucleo-Test-Ground-2/Core/Src/main.c
#include "stm32l4xx_hal.h"
#include "bq76952.h"
#include <math.h>
#include <stdbool.h>
#include <string.h>
#include <stdio.h>

// Function prototypes
// Initializing peripherals
void SystemClock_Config(void);
void GPIO_Init(void);
void SPI1_Init(void);
void USART1_Init(void);
void TIM1_Init(void);
void ADC1_Init(void);

uint8_t crc8(uint8_t *data, size_t len);

// Functions to handle communication with the AFE
void DirectCmdRead(uint8_t cmd, uint8_t *returnData, uint8_t len);
void DirectCmdWrite(uint8_t cmd, uint8_t *writeData, uint8_t len);
void SubCmdNoData(uint16_t cmd);
void SubCmdReadData(uint16_t cmd, uint8_t *returnData, uint8_t len);
void RAMRegisterRead(uint16_t addr, uint8_t *returnData, uint8_t len);
void RAMRegisterWrite(uint16_t addr, uint8_t *writeData, uint8_t len);

// Helper functions that do the handling for verifying the AFE received a SPI command
void AFETransmitReadCmd(uint8_t *txBytes, uint8_t *rxBytes, uint8_t arrSize);
void AFETransmitWriteCmd(uint8_t *txBytes, uint8_t *rxBytes, uint8_t arrSize);

// Other helper functions to transmit the data from the AFE to the UART lines
void TransmitCellVoltages(uint16_t *volts, uint8_t len);
void TransmitADCReadings(uint32_t *counts, uint8_t len);
void TransmitTemperatures(int16_t *temps, uint8_t len);
void TransmitSafetyStatusA(void);
void TransmitSafetyStatusB(void);

int16_t T4_Acquire(void);

void Error_Handler(void);

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin);

// Global defines
#define T4_BETA 3435.0
#define T4_R0 10000.0
#define T4_PU_R 17800.0
#define T4_PU_V 3.3
#define V_REF 2.048

// Global handles
SPI_HandleTypeDef hspi1;
UART_HandleTypeDef huart1;
TIM_HandleTypeDef htim1;
ADC_HandleTypeDef hadc1;

// Global variables - used for ISRs to raise flags
bool logDataFlag = 0;
bool logAlertsFlag = 0;

int main(void) {
    // HAL initialization
    HAL_Init();

    // System clock configuration
    SystemClock_Config();

    // Initialize GPIO, SPI, UART, TIM1, ADC1
    GPIO_Init();
    SPI1_Init();
    USART1_Init();
    TIM1_Init();
    ADC1_Init();

    // Start the logging timer
    TIM1->CR1 |= TIM_CR1_CEN;

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_RESET); // Turn off heartbeat

    // Blank array to store data from any commands that receive data
    uint8_t readData[32] = {0};

    uint16_t ctrlStatus = 0;
    uint16_t cellVolt = 0;
    uint16_t cellVolts[17] = {0};
    int16_t cellGains[16] = {12000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11900};
    uint32_t MCUTemperature = 0;
    int16_t AFETemperature = 0;
    int16_t temperatures[4] = {0};
    uint16_t currentRead = 0;
    uint8_t fetStatus = 0;
    uint8_t cmdAddr = 0;

    uint8_t writeData[32] = {0};

    // Read battery status register and manufacturing status register
	DirectCmdRead(0x12, readData, 2);
	SubCmdReadData(0x0057, readData, 2);
	HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_5);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_5);
	HAL_Delay(750);

	// Disable SLEEP mode and disable FET_TEST mode if already in FET_TEST
	SubCmdNoData(0x009A);
	if (!(readData[0] & (1 << 4))) SubCmdNoData(0x0022);

	// Read battery status register and manufacturing status register
	DirectCmdRead(0x12, readData, 2);
	SubCmdReadData(0x0057, readData, 2);

	// Enter CONFIG_UPDATE mode
	SubCmdNoData(0x0090);
	// Wait for Battery Status to confirm transition to CONFIG_UPDATE mode
	do {
		DirectCmdRead(0x12, readData, 2);
	} while (!(readData[0] & 0x01));

	/**
	 * ***********************************************************************************************
	 * CONFIGURING BQ76952 RAM REGISTERS
	 * ***********************************************************************************************
	 */

	/**
	 * Configuration settings registers
	 */
	// Configure TS pins
	writeData[0] = 0x07; // Thermistor temperature, for cell temperature protection
	RAMRegisterWrite(SET_CONF_TS1_CFG, writeData, 1);
	RAMRegisterWrite(SET_CONF_TS2_CFG, writeData, 1);
	writeData[0] = 0x0F; // Thermistor temperature, for FET temperature protection
	RAMRegisterWrite(SET_CONF_TS3_CFG, writeData, 1);
	// Configure ALERT pin
	writeData[0] = 0x2A;
	RAMRegisterWrite(SET_CONF_ALERT_CFG, writeData, 1);
	// Configure DA
	writeData[0] = 0x06;
	RAMRegisterWrite(SET_CONF_DA_CFG, writeData, 1);

	/**
	 * Protection settings registers
	 */
	writeData[0] = 0xFC;
	RAMRegisterWrite(SET_PROT_ENPROT_A, writeData, 1); // Enables SCD, OCD1, OCC, COV, CUV protection
	writeData[0] = 0xF7;
	RAMRegisterWrite(SET_PROT_ENPROT_B, writeData, 1); // Enables OTF, OTINT, OTD, OTC, and all UT protection
	writeData[0] = 0x00;
	RAMRegisterWrite(SET_PROT_ENPROT_C, writeData, 1); // Disables all special/latch protections
	writeData[0] = 0x98;
	RAMRegisterWrite(SET_PROT_CHGFET_PROT_A, writeData, 1); // SCD, OCC, and COV disable CHG FET
	writeData[0] = 0xD4;
	RAMRegisterWrite(SET_PROT_CHGFET_PROT_B, writeData, 1); // OTF, OTINT, OTC, and UTINT disable CHG FET
	writeData[0] = 0x00;
	RAMRegisterWrite(SET_PROT_CHGFET_PROT_C, writeData, 1); // Type C protections are disabled anyways
	writeData[0] = 0xE4;
	RAMRegisterWrite(SET_PROT_DSGFET_PROT_A, writeData, 1); // SCD, OCD1, OCD2, and CUV disable DSG FET
	writeData[0] = 0xE4;
	RAMRegisterWrite(SET_PROT_DSGFET_PROT_B, writeData, 1); // OTF, OTINT, OTD, and UTINT disable DSG FET
	writeData[0] = 0x00;
	RAMRegisterWrite(SET_PROT_DSGFET_PROT_C, writeData, 1); // Type C protections are disabled anyways

	/**
	 * FET settings registers
	 */
	// Enable PDSG, disable body diode protection, enable CHG FET in SLEEP
	writeData[0] = 0x1E;
	RAMRegisterWrite(SET_FET_OPTIONS, writeData, 1);
	format_uint16(writeData, 0x06A4);
	RAMRegisterWrite(SET_FET_PCHG_STRT_V, writeData, 2); // Min. cell voltage below 1700mV activates PCHG mode
	format_uint16(writeData, 0x06D6);
	RAMRegisterWrite(SET_FET_PCHG_STP_V, writeData, 2); // Min. cell voltage above 1750mV deactivates PCHG mode
	writeData[0] = 0x64;
	RAMRegisterWrite(SET_FET_PDSG_TO, writeData, 1); // PDSG timeout after 1000ms, enables DSG FET after
	writeData[0] = 0x64;
	RAMRegisterWrite(SET_FET_PDSG_STP_DLT, writeData, 1); // Exit PDSG and enable DSG FET when LD equals VBAT+ minus 1000mV

	/**
	 * Misc. settings
	 */
	// Setting MFG Status Init to disable FET Test commands
	format_uint16(writeData, 0x0050);
	RAMRegisterWrite(SET_MFG_STATUS_INIT, writeData, 2);
	// Setting DSG threshold to 100mA and CHG threshold to 50mA
	format_uint16(writeData, 0x000A);
	RAMRegisterWrite(SET_CURRTH_DSG_CURRTH, writeData, 2);
	format_uint16(writeData, 0x0005);
	RAMRegisterWrite(SET_CURRTH_CHG_CURRTH, writeData, 2);

	/**
	 * Cell balancing settings registers
	 */
	writeData[0] = 0x0F;
	RAMRegisterWrite(SET_CLBCFG_CONFIG, writeData, 1); // Exits SLEEP to perform balancing, allow balancing while charging and in relax mode
	writeData[0] = 0x0A;
	RAMRegisterWrite(SET_CLBCFG_CB_INTRVL, writeData, 1); // Recalculates which cells to balance every 10 seconds
	writeData[0] = 0x08;
	RAMRegisterWrite(SET_CLBCFG_CB_MAX_CLS, writeData, 1); // Allows up to 8 cells to be balanced at once
	// Min. cell voltage must be at least 2500mV for cell balancing to occur while charging or in relax mode
	format_uint16(writeData, 0x09C4);
	RAMRegisterWrite(SET_CLBCFG_CHG_MIN_V, writeData, 2);
	RAMRegisterWrite(SET_CLBCFG_RLX_MIN_V, writeData, 2);

	/**
	 * Power registers
	 */
	format_uint16(writeData, 0x0960);
	RAMRegisterWrite(PWR_SHDN_BATT_V, writeData, 2); // If pack voltage falls below 24000mV, AFE enters SHUTDOWN mode
	format_uint16(writeData, 0x000A);
	RAMRegisterWrite(PWR_SLP_CURR, writeData, 2); // Current above 10mA will cause device to exit SLEEP mode
	format_uint16(writeData, 0x0960);
	RAMRegisterWrite(PWR_SLP_CHG_V_THLD, writeData, 2); // If pack voltage falls below 24000mV, SLEEP mode is blocked when charger detected

	/**
	 * Protections registers
	 */
	writeData[0] = 0x23;
	RAMRegisterWrite(PROT_CUV_THLD, writeData, 1); // CUV triggered at 1.771V, cleared above 1.8732V
	writeData[0] = 0x35;
	RAMRegisterWrite(PROT_COV_THLD, writeData, 1); // COV triggered at 2.7324V, cleared below 2.6312V
	writeData[0] = 0x08;
	RAMRegisterWrite(PROT_OCC_THLD, writeData, 1); // OCC triggered at 16A
	writeData[0] = 0x15;
	RAMRegisterWrite(PROT_OCD1_THLD, writeData, 1); // OCD1 triggered at 42A
	writeData[0] = 0x64;
	RAMRegisterWrite(PROT_OCD1_DLY, writeData, 1); // OCD1 triggered after 340ms delay
	writeData[0] = 0x19;
	RAMRegisterWrite(PROT_OCD2_THLD, writeData, 1); // OCD2 triggered at 50A
	writeData[0] = 0x1C;
	RAMRegisterWrite(PROT_OCD2_DLY, writeData, 1); // OCD2 triggered after 100ms delay
	writeData[0] = 0x03;
	RAMRegisterWrite(PROT_SCD_THLD, writeData, 1); // SCD triggered at 60A
	RAMRegisterWrite(PROT_SCD_DLY, writeData, 1); // SCD triggered after 30µs delay
	writeData[0] = 0xEC;
	RAMRegisterWrite(PROT_UTD_THLD, writeData, 1); // UTD triggered at -20ºC
	RAMRegisterWrite(PROT_UTC_THLD, writeData, 1); // UTC triggered at -20ºC
	writeData[0] = 0xF1;
	RAMRegisterWrite(PROT_UTD_RCVR, writeData, 1); // UTD cleared above -15ºC
	RAMRegisterWrite(PROT_UTC_RCVR, writeData, 1); // UTC cleared above -15ºC

	/**
	 * Set calibration gain values for all cell voltages
	 */
	for (int i = 0; i < 16; i++) {
		format_int16(writeData, cellGains[i]);
		RAMRegisterWrite(CAL_GAIN_CL1 + i*2, writeData, 2);
	}

