far-mat42/custom-escooter/BMS PCB/Testing/STM32 Testing Ground/Nucleo-Test-Ground-2/Core/Src/main.c
		// For read command, confirm the AFE received the command by checking the address and CRC bytes
		if (txBytes[0] == rxBytes[0]) commReceived = true;
		// TODO: implement CRC checking for received data

		// Pull NSS high and wait for transaction to be processed
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
		HAL_Delay(1);
	}

}

/**
 * Handles the proper SPI communication procedure with the AFE for a SPI write command
 * @param txBytes Pointer to array containing the data to transmit
 * @param rxBytes Pointer to array containing the data to be received
 * @param arrSize Number of bytes that will be transmitted/received
 */
void AFETransmitWriteCmd(uint8_t *txBytes, uint8_t *rxBytes, uint8_t arrSize) {
	// Continuously transmit the SPI transaction until the AFE has received it
	bool commReceived = false;
	while (!commReceived)
	{
		// Pull NSS low
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
		// Transmit data and receive AFE's response
		HAL_SPI_TransmitReceive(&hspi1, txBytes, rxBytes, arrSize, HAL_MAX_DELAY);

		// For write command, confirm the AFE received the command by checking every single byte
		commReceived = true;
		for (int i = 0; i < arrSize; i++)
		{
			if (txBytes[i] != rxBytes[i]) commReceived = false; // If any mismatch occurs, flag it and retransmit
		}

		// Pull NSS high and wait for transaction to be processed
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
		HAL_Delay(1);
	}
}

/**
 * Helper function to transmit all the cell voltage readings over UART
 * @param volts Array containing the cell voltage readings
 * @param len Length of the provided array
 */
void TransmitCellVoltages(uint16_t *volts, uint8_t len) {
	char buffer[1024] = {0}; // Initialize buffer to store message
	char temp[32]; // Temporary buffer for each line

	for (int i = 1; i <= len; i++) {
		// Format the data into a single line
		snprintf(temp, sizeof(temp), "CV%d: %d mV\n", i, volts[i-1]);
		// Append the formatted data to the buffer
		strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
	}

	// Transmit the final message over UART
	HAL_UART_Transmit(&huart1, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
}

void TransmitADCReadings(uint32_t *counts, uint8_t len) {
	char buffer[1024] = {0}; // Initialize buffer to store message
	char temp[32]; // Temporary buffer for each line

	for (int i = 1; i <= len; i++) {
		// Format the data into a single line
		snprintf(temp, sizeof(temp), "CV%d: %lu mV\n", i, counts[i-1]);
		// Append the formatted data to the buffer
		strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
	}

	// Transmit the final message over UART
	HAL_UART_Transmit(&huart1, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
}

void TransmitTemperatures(int16_t *temps, uint8_t len) {
	char buffer[1024] = {0}; // Initialize buffer to store message
	char temp[32]; // Temporary buffer for each line

	// Separate variables for integer part and decimal part of temperature reading
	int16_t degC = 0;
	int16_t deg_int = 0;
	int16_t deg_dec = 0;

	for (int i = 1; i <= len; i++) {
		// Convert from Kelvin into Celsius
		degC = temps[i-1] - 2731;
		deg_int = degC / 10;
		deg_dec = degC % 10;
		// If temperature is negative, keep the decimal part positive
		if (degC < 0 && deg_dec != 0) deg_dec = abs(deg_dec);

		// Format the data into a single line
		snprintf(temp, sizeof(temp), "TS%d: %d.%d C\n", i, deg_int, deg_dec);
		// Append the formatted data to the buffer
		strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
	}

	// Transmit the final message over UART
	HAL_UART_Transmit(&huart1, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
}

/**
 * Helper function to transmit UART messages corresponding to any faults detected in the
 * Safety Status A register
 */
void TransmitSafetyStatusA(void) {
	// Read the bits of the Safety Status A register and transmit the appropriate message
	// if the corresponding fault was triggered
	uint8_t statusA[1] = {0};
	DirectCmdRead(0x03, statusA, 1);

	// Short Circuit Discharge
	if (statusA[0] & (1 << 7)) {
		uint8_t msg[] = "SCD fault triggered! Discharging will be disabled for a moment...\n";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Overcurrent in Discharge 1st Tier
	if (statusA[0] & (1 << 5)) {
		uint8_t msg[] = "OCD1 fault triggered! Discharging will be disabled for a moment...\n";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Overcurrent in Charge
	if (statusA[0] & (1 << 4)) {
		uint8_t msg[] = "OCC fault triggered! Charging will be disabled for a moment...\n";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Cell Overvoltage
	if (statusA[0] & (1 << 3)) {
		uint8_t msg[] = "COV fault triggered! Charging will be disabled until voltage drops sufficiently.\n";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Cell Undervoltage
	if (statusA[0] & (1 << 2)) {
		uint8_t msg[] = "CUV fault triggered! Discharging will be disabled until voltage rises sufficiently.\n";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
}

/**
 * Helper function to transmit UART messages corresponding to any faults detected in the
 * Safety Status B register
 */
void TransmitSafetyStatusB(void) {
	// Read the bits of the Safety Status B register and transmit the appropriate message
	// if the corresponding fault was triggered
	uint8_t statusB[1] = {0};
	DirectCmdRead(0x05, statusB, 1);

	// FET Overtemperature
	if (statusB[0] & (1 << 7)) {
		uint8_t msg[] = "OTF fault triggered! Discharging will be disabled for a moment...\n";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Internal Overtemperature
	if (statusB[0] & (1 << 6)) {
		uint8_t msg[] = "OTINT fault triggered! All AFE operations will be disabled for a moment...\n";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Overtemperature in Discharge
	if (statusB[0] & (1 << 5)) {
		uint8_t msg[] = "OTD fault triggered! Discharging will be disabled for a moment...\n";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Overtemperature in Charge
	if (statusB[0] & (1 << 4)) {
		uint8_t msg[] = "OTC fault triggered! Charging will be disabled for a moment...\n";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Internal Undertemperature
	if (statusB[0] & (1 << 2)) {
		uint8_t msg[] = "UTINT fault triggered! All AFE operations will be disabled for a moment...\n";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Undertemperature in Discharge
	if (statusB[0] & (1 << 1)) {
		uint8_t msg[] = "UTD fault triggered! No operational changes, but prolonged operation is not advised.\n";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Undertemperature in Charge
	if (statusB[0] & 0x01) {
		uint8_t msg[] = "UTC fault triggered! No operational changes, but prolonged operation is not advised.\n";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
}

int16_t T4_Acquire(void) {
    uint32_t adcValue = 0;
    float T4_volt = 0.0;
    float T4_res = 0.0;
    float T4_temp = 0.0;
    int16_t T4 = 0;

